{
  "backend/main.mo": "Motoko canister defining core domain types and logic for an interactive course platform, including users, courses, lessons, assessments, engagement metrics, certificates, payments, and Stripe integration with access control and storage mixins.",
  "feature_evidence.json": "Machine-readable report documenting frontend payment-related feature changes, listing affected files, components, test requirements, and confidence for removing hardcoded payment disablement in favor of runtime Stripe status.",
  "frontend-file-summaries.txt": "Aggregated JSON-style map providing concise summaries of frontend source files, describing routing, hooks, components, pages, styling, and recent payment-status related changes.",
  "frontend/index.css": "Global Tailwind CSS setup defining light and dark theme design tokens (OKLCH colors), layout variables, and base styles for the application UI.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React application to the root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Main React application component that sets up React Query, Internet Identity auth, hash-based routing, global layout, and payment success/failure flows with error boundaries and initialization handling.",
  "frontend/src/components/AdminAnalytics.tsx": "Admin dashboard analytics component displaying platform statistics, system initialization diagnostics, and a ranked table of top-performing learners.",
  "frontend/src/components/AlumniRegistryManager.tsx": "Displays and manages verified alumni records with search and filter controls for courses and external providers, fetching data via useGetAlumniRegistry. Renders a table with status badges, formatted dates, and record detail dialogs.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Renders an analytics dashboard showing engagement, quiz, and coding performance metrics with progress bars. Optionally displays aggregated certificate analytics such as totals and averages.",
  "frontend/src/components/CertificatePreview.tsx": "Generates a visual certificate preview with dynamic badges, scores, percentiles, and performance tiers based on a Certificate record. Computes averages and renders a styled certificate layout for display or download.",
  "frontend/src/components/EngagementMonitor.tsx": "Tracks and simulates real-time learner engagement using camera input and periodic metric updates. Provides controls to start/stop monitoring, displays live video, and reports engagement scores to a parent callback.",
  "frontend/src/components/ErrorBoundary.tsx": "Implements a React error boundary that catches runtime errors and shows a fallback UI with error details. Allows users to reset by refreshing the page.",
  "frontend/src/components/ExternalCertificationConfig.tsx": "Manages configuration of external certification provider APIs, including listing existing configs and adding new ones via a dialog form. Integrates with query hooks to fetch and persist provider settings.",
  "frontend/src/components/ExternalRegistrationStatus.tsx": "Displays the user's external certification registration records with status icons, badges, and dates, handling loading and empty states. Fetches data via a query hook and renders a card-based status list.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with copyright branding and a caffeine.ai link. Conditionally shows a notice when payments are temporarily disabled.",
  "frontend/src/components/Header.tsx": "Implements the top navigation bar with authentication controls, user menu, and view-based navigation for courses, dashboard, certificates, and admin. Integrates Internet Identity login/logout and React Query cache clearing.",
  "frontend/src/components/PaymentDialog.tsx": "Modal dialog for purchasing a course via Stripe, showing price breakdown and handling checkout session creation. Respects global payment-disabled state and provides loading and error feedback.",
  "frontend/src/components/ProfileSetupModal.tsx": "Forces new users to complete profile setup by entering their name before proceeding. Saves the initial user profile using the authenticated Internet Identity.",
  "frontend/src/components/StripeConfigDialog.tsx": "Admin dialog for configuring Stripe payments by saving a secret key and allowed countries. Handles form validation, mutation state, and error display.",
  "frontend/src/components/TestingModePanel.tsx": "React UI panel for a testing mode that generates mock engagement, scoring, and certificate data, displays results, and previews a mock certificate without affecting real user data.",
  "frontend/src/config/payments.ts": "Exports a single configuration flag to globally bypass payments for testing or maintenance purposes.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on Internet Identity, initializes access control, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInitializeDefaultCourses.ts": "Stubbed React Query hook intended to check or initialize default courses, currently returning placeholder counts because backend methods are not implemented.",
  "frontend/src/hooks/useInitializeSystem.ts": "Hooks for polling backend system health and determining readiness, plus a placeholder check for course availability, with automatic refetching until the system is ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration.",
  "frontend/src/hooks/usePaymentsStatus.ts": "Centralized hook that determines whether payments are disabled based on a bypass flag or backend Stripe configuration status.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks and helpers for interacting with backend APIs (profiles, courses, certificates, analytics), including Result unwrapping and mutation side effects.",
  "frontend/src/hooks/useSystemInitialization.ts": "Composite hook that coordinates system initialization, health polling, and course checks, exposing readiness state and retry logic while backend methods are partially stubbed.",
  "frontend/src/index.css": "Tailwind CSS base file defining light and dark theme color variables, typography defaults, and global styles using OKLCH colors. Includes base element styling and a small utility for balanced text wrapping.",
  "frontend/src/lib/defaultCourses.ts": "Defines a static list of default course data used by the app, including lessons, quizzes, coding challenges, prices, and placeholder video assets. Serves as seed or fallback content typed against the Course interface.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app, sets up React Query with a QueryClient, and wraps the app in Internet Identity and data providers. Imports global styles.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin interface for managing users, courses, lessons, pricing, certificates, payments, and platform analytics. Uses many query/mutation hooks and UI dialogs to create and configure platform content and settings.",
  "frontend/src/pages/CertificatesPage.tsx": "Authenticated page that lists the current user’s earned certificates, with loading, error, and empty states. Supports previewing and downloading certificates and prompts login if unauthenticated.",
  "frontend/src/pages/CoursePage.tsx": "Displays a single course’s details, lessons, and access controls, handling paid vs free courses and payment status. Allows authenticated users to purchase, start a course, and navigate into lessons.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing a hero section, platform features, and available courses fetched from the backend. Provides navigation into courses and the user dashboard depending on authentication state.",
  "frontend/src/pages/LessonPage.tsx": "Renders a lesson video page that loads course data, plays the lesson video, tracks playback progress, and marks the lesson complete when ~90% is watched, updating backend progress and UI state.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment cancellation/failure screen showing course context if available and provides navigation back to the course or home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Handles post-payment success flow by finalizing a Stripe session with the backend, showing processing/success/error states, and navigating the user to the unlocked course.",
  "frontend/src/pages/UserDashboard.tsx": "Implements an authenticated user dashboard that loads profile data, certificates, and analytics, shows login prompts when unauthenticated, and renders stats, certificates, and external registration status.",
  "frontend/src/types/index.ts": "Defines frontend TypeScript types mirroring backend data models, including courses, lessons, assessments, engagement metrics, user profiles, certificates, and external certification records.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions to read URL parameters from query or hash, persist them in sessionStorage, retrieve or clear them, and safely manage sensitive parameters during navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, scanning frontend source files, and extending the theme with CSS-variable-driven colors, container settings, border radii, shadows, and accordion animations. It registers typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata and living specification describing the DevLearn ICP web app, including schema/versioning, a high-level product summary, and a detailed list of existing features with IDs, descriptions, and versions. Used to track application scope, capabilities, and evolution over time."
}